{
  "doc-db8e99d8bf2a91d51e9b79e119cb6f03": {
    "content": "begin→end: begin defines the start timestamp of the data collection interval, and end (last time step + DELTA_T) is the end timestamp of the same interval; end cannot be earlier than begin, so begin is a prerequisite for determining end.\nedge→lane: edge represents a road segment (higher spatial unit), and lane is a single lane within that road segment (lower spatial unit); a lane cannot exist independently of an edge, so edge is a prerequisite for lane.\nspeed→traveltime: traveltime is an estimation of the time to pass the edge/lane based on mean speed (calculated as distance/speed); for a fixed edge/lane length, changes in speed directly cause proportional changes in traveltime (lower speed → longer traveltime, higher speed → shorter traveltime).\nspeed→overlapTraveltime: overlapTraveltime is an estimation of the time for any part of a vehicle to pass the edge/lane based on mean speed (calculated as (edge/lane length + average vehicle length)/speed); for fixed edge/lane length and average vehicle length, changes in speed directly cause proportional changes in overlapTraveltime (lower speed → longer overlapTraveltime, higher speed → shorter overlapTraveltime).\nspeed→speedRelative: speedRelative is the quotient of mean speed and the lane speed limit; with a fixed lane speed limit, changes in speed directly cause proportional changes in speedRelative (higher speed → higher speedRelative, lower speed → lower speedRelative).\nlaneDensity→density: density is the vehicle density on the edge, which is the average of laneDensity (vehicle density per lane) across all lanes of the edge; laneDensity values of each lane in the edge are the basis for calculating edge-level density.\ndensity→speed: density is the number of vehicles per unit road length; higher density leads to more vehicle interactions (e.g., braking, following), which reduce mean speed; lower density reduces such interactions, allowing higher mean speed.\noccupancy→speed: occupancy is the percentage of the edge/lane occupied by vehicles; higher occupancy means less free space for vehicle movement, leading to more speed reductions; lower occupancy provides more free space, enabling higher speeds.\nspeed→waitingTime: waitingTime is the total time vehicles are halted (speed < speedThreshold); lower speed (especially below the threshold) increases the time vehicles spend halted, raising waitingTime; higher speed (above the threshold) reduces halted time, lowering waitingTime.\nspeed→timeLoss: timeLoss is the total time vehicles lose due to driving slower than desired; lower speed increases the gap between actual and desired travel time, leading to higher timeLoss; higher speed narrows this gap, reducing timeLoss.\nentered→sampledSeconds: sampledSeconds is the sum of vehicles present on the edge/lane per second over the interval; more vehicles entering the edge/lane (higher entered) increases the number of vehicles present each second, raising sampledSeconds.\ndeparted→sampledSeconds: departed is the number of vehicles emitted onto the edge/lane; more emitted vehicles (higher departed) increases the number of vehicles present per second, increasing sampledSeconds.\nlaneChangedTo→sampledSeconds: laneChangedTo is the number of vehicles changing to the lane; more vehicles changing into the lane (higher laneChangedTo) increases the number of vehicles present each second, raising sampledSeconds.\nleft→sampledSeconds: left is the number of vehicles leaving the edge/lane downstream; more vehicles leaving (higher left) reduces the number of vehicles present per second, lowering sampledSeconds.\nlaneChangedFrom→sampledSeconds: laneChangedFrom is the number of vehicles changing away from the lane; more vehicles changing out (higher laneChangedFrom) reduces the number of vehicles present per second, lowering sampledSeconds.\nvaporized→sampledSeconds: vaporized is the number of vehicles removed from the edge; more removed vehicles (higher vaporized) reduces the number of vehicles present per second, lowering sampledSeconds.\nteleported→sampledSeconds: teleported is the number of vehicles relocated from the edge; more relocated vehicles (higher teleported) reduces the number of vehicles present per second, lowering sampledSeconds.\nlaneChangedFrom→laneDensity: laneChangedFrom is the number of vehicles leaving the lane; more vehicles leaving (higher laneChangedFrom) reduces the number of vehicles in the lane, lowering laneDensity (for fixed lane length).\nlaneChangedTo→laneDensity: laneChangedTo is the number of vehicles entering the lane; more vehicles entering (higher laneChangedTo) increases the number of vehicles in the lane, raising laneDensity (for fixed lane length).\ndeparted→laneDensity: departed is the number of vehicles emitted onto the lane; more emitted vehicles (higher departed) increases the number of vehicles in the lane, raising laneDensity (for fixed lane length).\nentered→laneDensity: entered is the number of vehicles entering the lane from upstream; more entering vehicles (higher entered) increases the number of vehicles in the lane, raising laneDensity (for fixed lane length).\nleft→laneDensity: left is the number of vehicles leaving the lane downstream; more leaving vehicles (higher left) reduces the number of vehicles in the lane, lowering laneDensity (for fixed lane length).\nvaporized→laneDensity: vaporized is the number of vehicles removed from the lane; more removed vehicles (higher vaporized) reduces the number of vehicles in the lane, lowering laneDensity (for fixed lane length).\nteleported→laneDensity: teleported is the number of vehicles relocated from the lane; more relocated vehicles (higher teleported) reduces the number of vehicles in the lane, lowering laneDensity (for fixed lane length).\nlaneDensity→laneChangedFrom: laneDensity is the vehicle density per lane; if the target lane has higher laneDensity than adjacent lanes, vehicles are more likely to change away from it, increasing laneChangedFrom.\nlaneDensity→laneChangedTo: laneDensity is the vehicle density per lane; if the target lane has lower laneDensity than adjacent lanes, vehicles are more likely to change into it, increasing laneChangedTo.\nsampledSeconds→waitingTime: sampledSeconds quantifies total vehicle-seconds of presence on the edge/lane; more vehicle-seconds (higher sampledSeconds) increase the probability of vehicles being halted, raising waitingTime (especially in congested conditions).\nsampledSeconds→timeLoss: sampledSeconds represents total vehicle-seconds of presence; more vehicle-seconds (higher sampledSeconds) increase the time vehicles spend driving slower than desired, raising timeLoss (especially in congested conditions).\nspeedRelative→timeLoss: speedRelative reflects the ratio of actual speed to the speed limit; lower speedRelative (actual speed much lower than the limit) increases the gap between actual and desired travel time, leading to higher timeLoss.\nedge→density: density is the vehicle density on the edge; the edge defines the spatial scope for measuring density, so edge is a prerequisite for calculating density.\nlane→laneDensity: laneDensity is the vehicle density per lane; the lane defines the spatial scope for measuring laneDensity, so lane is a prerequisite for calculating laneDensity.\nedge→occupancy: occupancy is the percentage of the edge occupied by vehicles; the edge defines the spatial scope for measuring occupancy, so edge is a prerequisite for calculating occupancy.\nlane→occupancy: occupancy can also be measured at the lane level; the lane defines the spatial scope for lane-level occupancy, so lane is a prerequisite for calculating lane-level occupancy.\nbegin→sampledSeconds: sampledSeconds is summed over the measurement interval starting at begin; begin defines the start of the interval, so it is a prerequisite for calculating sampledSeconds.\nend→sampledSeconds: sampledSeconds is summed over the measurement interval ending at end; end defines the end of the interval, so it is a prerequisite for calculating sampledSeconds.",
    "create_time": 1757559079,
    "update_time": 1757559079,
    "_id": "doc-db8e99d8bf2a91d51e9b79e119cb6f03"
  }
}